apple-open-source/macos/IOUSBFamily/AppleUSBHub/Classes/AppleUSBHub.cpp
        if ( !_workThread || !_resetPortZeroThread || !_hubDeadCheckThread || !_clearFeatureEndpointHaltThread || !_clearDevZeroLockThread )
        {
            USBError(1, "%s[%p] could not allocate all thread functions.  Aborting start", getName(), this);
            goto ErrorExit;
        }

        locationIDProperty = (OSNumber *) provider->getProperty(kUSBDevicePropertyLocationID);
        if ( locationIDProperty )
        {
            _locationID = locationIDProperty->unsigned32BitValue();
        }
        USBLog(1, "[%p] USB Generic Hub @ %d (0x%x)", this, _address, _locationID);
        
	_inStartMethod = false;
        DecrementOutstandingIO();
	err = RearmInterruptRead();
	if (err == kIOReturnSuccess)
	    return true;
    }
    else
    {
    
        USBError(1,"%s[%p]::start Aborting startup: error 0x%x", getName(), this, err);
        if ( _device && _device->isOpen(this) )
            _device->close(this);
        stop(provider);
    }

ErrorExit:

    if ( _timerSource )
    {
        if ( _workLoop )
            _workLoop->removeEventSource(_timerSource);
        _timerSource->release();
        _timerSource = NULL;
    }

    if (_gate)
    {
	if (_workLoop)
	    _workLoop->removeEventSource(_gate);
	    
	_gate->release();
	_gate = NULL;
    }

    if ( _workLoop != NULL )
    {
        _workLoop->release();
        _workLoop = NULL;
    }

    _inStartMethod = false;
    DecrementOutstandingIO();
    return false;
}



void 
AppleUSBHub::stop(IOService * provider)
{
    if (_buffer) 
    {
        _buffer->release();
	_buffer = 0;
    }
    if(_hubInterface) 
    {
        _hubInterface->close(this);
        _hubInterface->release();
        _hubInterface = NULL;
    }
    
    if (_timerSource)
    {
        if ( _workLoop )
            _workLoop->removeEventSource(_timerSource);

        _timerSource->release();
        _timerSource = NULL;
    }
        
    if (_workThread)
    {
        thread_call_cancel(_workThread);
        thread_call_free(_workThread);
    }
    
    if (_resetPortZeroThread)
    {
        thread_call_cancel(_resetPortZeroThread);
        thread_call_free(_resetPortZeroThread);
    }
    
    if (_hubDeadCheckThread)
    {
        thread_call_cancel(_hubDeadCheckThread);
        thread_call_free(_hubDeadCheckThread);
    }

    if (_clearFeatureEndpointHaltThread)
    {
        thread_call_cancel(_clearFeatureEndpointHaltThread);
        thread_call_free(_clearFeatureEndpointHaltThread);
    }
    if (_clearDevZeroLockThread)
    {
        thread_call_cancel(_clearDevZeroLockThread);
        thread_call_free(_clearDevZeroLockThread);
    }
    
    if (_device)
    {
        // Set it to NULL, since our provider will go away after this stop call
        //
        _device = 0;
    }

    super::stop(provider);
}

IOReturn
AppleUSBHub::ConfigureHub()
{
    IOReturn 				err = kIOReturnSuccess;
    IOUSBFindInterfaceRequest		req;
    const IOUSBConfigurationDescriptor *cd;
    IOUSBControllerV2			*v2Bus;

    // Reset some of our variables that so that when we reconfigure due to a reset
    // we don't reuse old values
    //
    _busPowerGood = false;
    _powerForCaptive = 0;
    _numCaptive = 0;

    // Find the first config/interface
    if (_device->GetNumConfigurations() < 1)
    {
        USBError(1,"%s[%p]::ConfigureHub No hub configurations", getName(), this);
        err = kIOReturnNoResources;		// Need better error
        goto ErrorExit;
    }

    // set the configuration to the first config
    cd = _device->GetFullConfigurationDescriptor(0);
    if (!cd)
    {
        USBError(1,"%s[%p]::ConfigureHub No config descriptor", getName(), this);
        err = kIOUSBConfigNotFound;
        goto ErrorExit;
    }

    err = _device->SetConfiguration(this, cd->bConfigurationValue, false);
    
    if (err)
    {
        USBError(1,"%s[%p]::ConfigureHub SetConfiguration failed. Error 0x%x", getName(), this, err);
        goto ErrorExit;
    }
        
    // Set the remote wakeup feature if it's supported
    //
    if (cd->bmAttributes & kUSBAtrRemoteWakeup)
    {
        USBLog(3,"%s[%p]::ConfigureHub Setting kUSBFeatureDeviceRemoteWakeup for Hub device (%p)", getName(), this, _device);
        err = _device->SetFeature(kUSBFeatureDeviceRemoteWakeup);
        if ( err)
            USBError(1,"%s[%p]::ConfigureHub SetFeature(kUSBFeatureDeviceRemoteWakeup) failed. Error 0x%x", getName(), this, err);
    }

    // Find the interface for our hub -- there's only one
    //
    req.bInterfaceClass = kUSBHubClass;
    req.bInterfaceSubClass = kIOUSBFindInterfaceDontCare;
    req.bInterfaceProtocol = kIOUSBFindInterfaceDontCare;
    req.bAlternateSetting = kIOUSBFindInterfaceDontCare;
    if ((_hubInterface = _device->FindNextInterface(NULL, &req)) == 0)
    {
        USBError(1,"%s[%p]::ConfigureHub no interface found", getName(), this);
        err = kIOUSBInterfaceNotFound;
        goto ErrorExit;
    }
    
    _hubInterface->retain();
    
    
    _busPowered = (cd->bmAttributes & kUSBAtrBusPowered) ? TRUE : FALSE;	//FIXME
    _selfPowered = (cd->bmAttributes & kUSBAtrSelfPowered) ? TRUE : FALSE;

    if( !(_busPowered || _selfPowered) )
    {
        USBError(1,"%s[%p]::ConfigureHub illegal device config - no power", getName(), this);
        err = kIOReturnNoPower;		// Need better error code here.
        goto ErrorExit;
    }

    // Get the hub descriptor
    if ( (err = GetHubDescriptor(&_hubDescriptor)) )
    {
        USBError(1,"%s[%p]::ConfigureHub could not get hub descriptor (0x%x)", getName(), this, err);
        goto ErrorExit;
    }
    
    if(_hubDescriptor.numPorts < 1)
    {
        USBLog(1,"%s[%p]::ConfigureHub there are no ports on this hub", getName(), this);
    }
    if(_hubDescriptor.numPorts > 7)
    {
        USBLog(1,"%s[%p]::ConfigureHub there are an awful lot of ports (%d) on this hub", getName(), this, _hubDescriptor.numPorts);
    }
    _readBytes = ((_hubDescriptor.numPorts + 1) / 8) + 1;
    
    // Setup for reading status pipe
    _buffer = IOBufferMemoryDescriptor::withCapacity(_readBytes, kIODirectionIn);

    if (!_hubInterface->open(this))
    {
        USBError(1," %s[%p]::ConfigureHub could not open hub interface", getName(), this);
        err = kIOReturnNotOpen;
        goto ErrorExit;
    }
    
    // after opening the interface, but before we get the pipe, we need to see if this is a 2.0
    // capabale hub, and if so, we need to set the multiTT status if possible
    _multiTTs = false;
    _hsHub = false;
    
    if (_device->GetbcdUSB() >= 0x200)
    {
	v2Bus = OSDynamicCast(IOUSBControllerV2, _device->GetBus());
	if (v2Bus)
	{
	    switch (_device->GetProtocol())
	    {
		case 0:
                    USBLog(5, "%s[%p]::ConfigureHub - found FS/LS only hub", getName(), this);
		    break;
		    
		case 1:
                    USBLog(5, "%s[%p]::ConfigureHub - found single TT hub", getName(), this);
		    v2Bus->AddHSHub(_address, 0);
                    _hsHub = true;
		    break;
		    
